{
  "architectures": [
    "DelveForCausalLM"
  ],
  "attention_hidden_size": 1024,
  "bos_token_id": 0,
  "eos_token_id": 0,
  "pad_token_id": 0,
  "classifier_dropout": 0.1,
  "conv_kernel": 4,
  "dt_rank": "auto",
  "expand": 2,
  "fused_add_norm": true,
  "hidden_act_mamba": "silu",
  "hidden_act_pythia": "gelu",
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "initializer_range_mamba": 0.1,
  "intermediate_size": 4096,
  "intermediate_size_mamba": 2048,
  "layer_norm_epsilon": 1e-05,
  "context_length": 1024,
  "model_type": "delve",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "num_mamba_layers": 48,
  "pad_vocab_size_multiple": 8,
  "rescale_every": 6,
  "rescale_prenorm_residual": false,
  "residual_in_fp32": true,
  "rms_norm": true,
  "ssm_cfg": {},
  "state_size": 16,
  "tie_word_embeddings": true,
  "time_step_floor": 0.0001,
  "time_step_init_scheme": "random",
  "time_step_max": 0.1,
  "time_step_min": 0.001,
  "time_step_rank": 64,
  "time_step_scale": 1.0,
  "torch_dtype": "float32",
  "transformers_version": "4.39.0",
  "use_bias": false,
  "use_cache": true,
  "use_conv_bias": true,
  "use_parallel_residual": true,
  "vocab_size": 50432
}
